In [1]:
# ANS 2:
import pandas as pd
df = pd.DataFrame({'A': [1,2,3,4,5], 'B':[12,34,54,56,76] ,'C':[33,36,1,5,4]})

In [2]:
df

   A   B   C
0  1  12  33
1  2  34  36
2  3  54   1
3  4  56   5
4  5  76   4

In [3]:
df

   A   B   C
0  1  12  33
1  2  34  36
2  3  54   1
3  4  56   5
4  5  76   4

In [4]:
df = df.reset_index()

In [5]:
df

   index  A   B   C
0      0  1  12  33
1      1  2  34  36
2      2  3  54   1
3      3  4  56   5
4      4  5  76   4

In [6]:
len(df)

5

In [7]:
def new_index(x):
    if x==0:
        return 1
    else:
        x=x+2
    return x
df['new_index'] = df['index'].apply(new_index)

In [8]:
df

   index  A   B   C  new_index
0      0  1  12  33          1
1      1  2  34  36          3
2      2  3  54   1          4
3      3  4  56   5          5
4      4  5  76   4          6

In [9]:
df.drop('index' , axis=1,inplace=True)

In [10]:
df.set_index('new_index')

           A   B   C
new_index
1          1  12  33
3          2  34  36
4          3  54   1
5          4  56   5
6          5  76   4

In [11]:
# ANS 1:
df.head(2)

   A   B   C  new_index
0  1  12  33          1
1  2  34  36          3

In [12]:
df.isnull().sum()

A            0
B            0
C            0
new_index    0
dtype: int64

In [13]:
df.mean()

A             3.0
B            46.4
C            15.8
new_index     3.8
dtype: float64

In [14]:
df.sum()

A             15
B            232
C             79
new_index     19
dtype: int64

In [15]:
df.columns

Index(['A', 'B', 'C', 'new_index'], dtype='object')

In [16]:
# ANS 3:
df

   A   B   C  new_index
0  1  12  33          1
1  2  34  36          3
2  3  54   1          4
3  4  56   5          5
4  5  76   4          6

In [17]:
def values(x):
    return x.sum()
a = df[0:3].apply(values)

In [18]:
a["B"]

100

In [19]:
# ANS 4:
text_data = pd.DataFrame({"text":["my name is chaitanya" , "I aspiring to become data scientists"]})

In [20]:
text_data

                                   text
0                  my name is chaitanya
1  I aspiring to become data scientists

In [21]:
text_data["word_count"]=text_data["text"].apply(lambda x:len(x.split()))

In [22]:
text_data

                                   text  word_count
0                  my name is chaitanya           4
1  I aspiring to become data scientists           6

In [23]:
# ANS 5:
df.size
# gives the total number of elements in a dataframe

20

In [24]:
df.shape
# gives the no. of rows and columns

(5, 4)

In [25]:
# ANS 6:
# pd.read_excel() is used to read an excel file

In [26]:
# ANS 7 :
ed = {"email" : ["chai@gmail.com","sai@gmail.com","uday@gmail.com"]}

In [27]:
df2 = pd.DataFrame(ed)

In [28]:
df2

            email
0  chai@gmail.com
1   sai@gmail.com
2  uday@gmail.com

In [29]:
 df2['username'] = df2['email'].str.split('@').str[0]

In [30]:
df2

            email username
0  chai@gmail.com     chai
1   sai@gmail.com      sai
2  uday@gmail.com     uday

In [31]:
# ANS 8:
data = {'A':[3,8,6,2,9] ,"B":[5,2,9,3,1],"C":[1,7,4,5,2]}

In [32]:
df8 = pd.DataFrame(data)

In [33]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
df8[(df8['A']>5) | (df8['B']<10)]

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [35]:
# ANS 9 :
data1 = {'values':[3,8,6,2,9] ,"B":[5,2,9,3,1],"C":[1,7,4,5,2]}

In [36]:
df9 = pd.DataFrame(data1)

In [37]:
df9

   values  B  C
0       3  5  1
1       8  2  7
2       6  9  4
3       2  3  5
4       9  1  2

In [38]:
df9["values"].mean()

5.6

In [39]:
df9["values"].median()

6.0

In [40]:
df9["values"].std()

3.0495901363953815

In [41]:
# ANS 10:
ddf = pd.DataFrame({"sales":[10,20,30,40,50,60,70,80],
                    "date":pd.date_range(start="2023-04-01" , end="2023-04-08")
                   })

In [42]:
ddf

   sales       date
0     10 2023-04-01
1     20 2023-04-02
2     30 2023-04-03
3     40 2023-04-04
4     50 2023-04-05
5     60 2023-04-06
6     70 2023-04-07
7     80 2023-04-08

In [43]:
ddf["movingaverage"]=ddf["sales"].rolling(window=7,min_periods=1).mean()

In [44]:
ddf

   sales       date  movingaverage
0     10 2023-04-01           10.0
1     20 2023-04-02           15.0
2     30 2023-04-03           20.0
3     40 2023-04-04           25.0
4     50 2023-04-05           30.0
5     60 2023-04-06           35.0
6     70 2023-04-07           40.0
7     80 2023-04-08           50.0

In [51]:
# ANS 11:
ddf1 = pd.DataFrame({
                    "date":pd.date_range(start="2023-04-01" , end="2023-04-08")
                   })

In [52]:
ddf1

        date
0 2023-04-01
1 2023-04-02
2 2023-04-03
3 2023-04-04
4 2023-04-05
5 2023-04-06
6 2023-04-07
7 2023-04-08

In [47]:
ddf1["Weekday"]=ddf1["date"].dt.day

In [48]:
ddf1

        date  Weekday
0 2023-04-01        1
1 2023-04-02        2
2 2023-04-03        3
3 2023-04-04        4
4 2023-04-05        5
5 2023-04-06        6
6 2023-04-07        7
7 2023-04-08        8

In [90]:
# ANS 12:
ddf5 = pd.DataFrame({
                    "date":pd.date_range(start="2023-03-01" , end="2023-03-31")
                   })

In [91]:
ddf5

         date
0  2023-03-01
1  2023-03-02
2  2023-03-03
3  2023-03-04
4  2023-03-05
5  2023-03-06
6  2023-03-07
7  2023-03-08
8  2023-03-09
9  2023-03-10
10 2023-03-11
11 2023-03-12
12 2023-03-13
13 2023-03-14
14 2023-03-15
15 2023-03-16
16 2023-03-17
17 2023-03-18
18 2023-03-19
19 2023-03-20
20 2023-03-21
21 2023-03-22
22 2023-03-23
23 2023-03-24
24 2023-03-25
25 2023-03-26
26 2023-03-27
27 2023-03-28
28 2023-03-29
29 2023-03-30
30 2023-03-31

In [92]:
td = pd.Timedelta(days = 1,hours=5)

In [93]:
ddf5["Timestamp"]  = ddf5 + td

In [94]:
ddf5

         date           Timestamp
0  2023-03-01 2023-03-02 05:00:00
1  2023-03-02 2023-03-03 05:00:00
2  2023-03-03 2023-03-04 05:00:00
3  2023-03-04 2023-03-05 05:00:00
4  2023-03-05 2023-03-06 05:00:00
5  2023-03-06 2023-03-07 05:00:00
6  2023-03-07 2023-03-08 05:00:00
7  2023-03-08 2023-03-09 05:00:00
8  2023-03-09 2023-03-10 05:00:00
9  2023-03-10 2023-03-11 05:00:00
10 2023-03-11 2023-03-12 05:00:00
11 2023-03-12 2023-03-13 05:00:00
12 2023-03-13 2023-03-14 05:00:00
13 2023-03-14 2023-03-15 05:00:00
14 2023-03-15 2023-03-16 05:00:00
15 2023-03-16 2023-03-17 05:00:00
16 2023-03-17 2023-03-18 05:00:00
17 2023-03-18 2023-03-19 05:00:00
18 2023-03-19 2023-03-20 05:00:00
19 2023-03-20 2023-03-21 05:00:00
20 2023-03-21 2023-03-22 05:00:00
21 2023-03-22 2023-03-23 05:00:00
22 2023-03-23 2023-03-24 05:00:00
23 2023-03-24 2023-03-25 05:00:00
24 2023-03-25 2023-03-26 05:00:00
25 2023-03-26 2023-03-27 05:00:00
26 2023-03-27 2023-03-28 05:00:00
27 2023-03-28 2023-03-29 05:00:00
28 2023-03-29 2023-03-30 05:00:00
29 2023-03-30 2023-03-31 05:00:00
30 2023-03-31 2023-04-01 05:00:00

In [ ]:
# ANS 13:
# we need to import pandas library as pd